[
    {
        "id": 1,
        "name": "Tokwa't Baboy",
        "author": "Philippe Edralin",
        "image": "resources/philippines/tokwatb.png",
        "description": "Tokwa’t Baboy is generally considered as an appetizer or a side dish. This is something you eat while you’re drinking with friends or family as a pulutan, while others also love to eat this together with some lugaw. Personally, it took a long time for me to start liking this dish. Mostly because it has tokwa. I hate tokwa. Back then, I did my best to eat this dish while avoiding any tofu. Now, I tolerate it enough to enjoy the dish as a whole; and to be honest, I don’t think this dish is complete without the tofu. This dish is also very easy to make, and you can even enjoy this as a main course.",
        "ingredients": ["Pig Ears", "Pork Belly", "Tofu", "Black Peppercorn", "Onion", "Chili Pepper", "Water", "Cooking Oil"],
        "preparation": "This dish combines two different textures: the crispy tofu and tender pork, which makes it contrast very well. Key spices included are garlic, black peppercorns, and chili peppers. These add a kick to the dish, and some versions even include ginger for extra warmth.",
        "sensory": ["A vibrant mix of golden-brown tofu cubes and tender pork, garnished with red onions and green chili slices. It really depends on what recipe you follow, though.", "A strong, mouthwatering aroma of vinegar, soy sauce, garlic, and onions, with a slight smokiness from the fried tofu.", "Crispy on the outside (tofu), tender and slightly chewy (pork), with a sauce that coats everything perfectly.", "A harmonious blend of salty, tangy, and umami flavors, with the mild heat of chili peppers and the richness of pork. The vinegar cuts through the fat, making each bite refreshing. This can go along with anything (not everything- don't eat this with... like... ice cream. I don't know why you would want to do that though. Weirdo.)"],
        "recommend": "I really recommend this dish to everyone. Try it out next time you drink some alcohol (moderately- MODERATELY PLEASE) with friends and family! I swear you won't regret trying this out. I know I didn't."
    },
    {
        "id": 2,
        "name": "Pork Adobo",
        "author": "Philippe Edralin",
        "image": "resources/philippines/adobo.png",
        "description": "Like most Filipinos (at least, the TRUE ones), my favorite food of all time is Adobo. May it be Pork Adobo, Chicken Adobo, Adobong Leeg, Adobong lahat- I like every type of Adobo. Except Adobong Pusit, though. Why? Because squid. Ew. Anyway, I usually don’t trust a Filipino chef if they don’t know how to cook this dish. This is a staple food of our country- not knowing how to cook this masterpiece is blasphemy! The word adobar is a Spanish word that means “to marinate”, and is the origin of the name of this dish. Each region in the Philippines has their own variations of cooking this food. Some add coconut milk (Adobo sa Gata), some forgo some ingredients like Soy Sauce and just use Vinegar (Adobong Puti), and even some use turmeric (Adobong Dilaw). This food review will focus on the classic, Pork Adobo, which marinates pork in soy sauce and crushed garlic, along with vinegar. The full ingredients are listed below.",
        "ingredients": ["Pork Belly", "Garlic", "Dried Bay Leaves", "Vinegar", "Soy Sauce", "Black Peppercorn", "Water", "Salt"],
        "preparation": "Adobo's unique technique involves braising the meat in vinegar and soy sauce, which adds flavor and acts as a natural preservative. The key spices used here are black peppercorns, bay leaves, and garlic. As mentioned earlier, there are some variations that make use of other spices- one of which uses star anise for a slightly sweeter aroma.",
        "sensory": ["A rich, deep-brown sauce coats the pork. Personally, it's more appetizing when I see the black peppercorns and bay leaves scattered around the dish. As a personal preference, I also want the garlic to be whole cloves instead of crushed since I want to eat it in chunks. Don't judge me. I have my own preferences- I'm not judging yours!", "Even when it's still being cooked, you know the smell of Adobo. It has such a distinct smell that sometimes when it leaks in my room while I'm doing some busy academic work (playing games), I make it my personal mission to drop everything and be the first at the table. It really entices you with its aroma.", "While I don't dislike crispy adobo, I find the tender, easy to cut, melts in your mouth type of pork better. I like being able to spread around the sauce on my rice too, so that's a plus.", "Lastly, the first bite is an explosion of flavors. The soy sauce provides deep umami (as the Japanese would say (also me)), while the vinegar adds a kick that lingers on the tongue. All the ingredients and spices work together making it a perfect blend of bold flavors. This is why I can't forget about this dish."],
        "recommend": "All-in-all, I wholeheartedly recommend this dish to people of all ages (as long as they can eat it- ask your doctor!). It's a dish that really embodies the heart of Filipino cooking in my opinion. Simple ingredients transformed into something deeply comforting and rich in history. Another reason to love this dish is its versatility. It really depends on you how you want to cook this. Don't really like soy sauce? Okay, just go with vinegar for adobong puti! Want to pair it with coconut milk? Sure! Add some for adobo sa gata. There are loads of different ways to cook this, which means a lot of ways to enjoy it. This is my personal comfort food, and if you haven't tried this yet for some reason- go now! As in, now. Stop reading this and go ask someone to cook this for you- or better yet- cook it yourself. As Rufa Mae says: Go Go Go!"
    },
    {
        "id": 3,
        "name": "Bibingka",
        "author": "Philippe Edralin",
        "image": "resources/philippines/bibingka.png",
        "description": "Merry Christmas! Here’s your gift…. Oh? You don’t want it? What? Okay fine, here’s your obligatory bibingka. Happy? Of course you are! There is one thing Filipinos love as much as food- and that is more food. During Christmas (which typically encompasses all the -ber months), bibingka is a classic Christmas dessert. You can find it being sold anywhere by street vendors, especially near churches. You typically enjoy bibingka with puto bumbong (not puto in Spanish- puto bumbong the rice cake!) and some hot drinks like coffee or chocolate. Eating this dish will sometimes blow you back into nostalgia, bringing you back to simpler times where your biggest problem was writing your name in cursive fifty times. Okay, that sounds bad now that I think about it. I absolutely abhor writing my name multiple times in cursive- maybe it’s because I have three first names and all of them are long, including my middle name and last name. I ranted enough. Ingredients!",
        "ingredients": ["Rice flour", "Salt", "Baking Powder", "Butter", "Granulated Sugar", "Nutmeg", "Coconut Milk", "Fresh Milk", "Salted Duck Egg", "Grated Cheese", "Chicken Eggs", "Grated Coconut", "Banana Leaf"],
        "preparation": "I know I know, this doesn't really have that much spices in it since it's baked, but you can argue that Coconut Milk is! Right? Please? Okay fine. The key spice here is nutmeg, which is sometimes added for warmth and depth. What makes this dish special is its charcoal cooking method, which gives it a slightly smoky flavor.",
        "sensory": ["A golden, slightly charred top, often sprinkled with grated coconut, butter, and salted egg slices.", "A warm, toasty aroma with hints of coconut, butter, and caramelized banana leaves.", "Soft and spongy, with a slightly crisp top.", "A delicate balance of sweetness from the coconut milk, richness from the butter, and a hint of saltiness from the salted egg."],
        "recommend": "I highly recommend trying out Bibingka if you haven't already. You don't have to wait for the holiday seasons to come! Bake it at home if you like, but I'm sure you can find some being sold in a 'pasalubong' store somewhere. Go to Tagaytay or something. Whatever you choose to do, I just hope you try it out!"
    },
    {
        "id": 4,
        "name": "Hainanese Chicken Rice",
        "author": "Aliexandra Po",
        "image": "resources/singapore/hainanese.png",
        "description": "Ask anyone where they can eat good food for cheap in Singapore, and I guarantee you’ll get this answer- Tiong Bahru Food Centre. Stepping into Tiong Bahru Food Centre is a feast for the senses. The air is filled with the super good aroma of sizzling wok-fried noodles, savory chicken rice, and fragrant laksa. The smell of freshly brewed kopi wafts from drink stalls, blending with the scent of kaya toast being grilled to perfection.  Visually, it’s a vibrant scene, from the vibrant food displays to the lively chatter of diners. Whether you're a local or a tourist like me, the atmosphere makes you want to pull out your wallet and try all that  Singapore has to offer. During my visit, I tried Hainanese Chicken Rice from one of the stalls there. What sets this dish apart is its medley of perfectly balanced ingredients. The rice, cooked in rich chicken fat, was very fragrant and fluffy. The chicken itself was tender and juicy, served with a super flavorful ginger sauce that provided a crisp contrast. The combination of savory, spicy, and fresh elements made each bite unforgettable—a true representation of Singapore’s culinary brilliance.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["A beautifully plated dish with slices of steamed chicken with ginger sauce generously sprinkled on top of it, neatly arranged beside a bed of golden, fragrant rice.", "The rich aroma of chicken fat-infused rice fills the air, aside from this there's a hint of soy and a subtle fragrance of ginger from the perfectly poached chicken.", "Each bite is a perfect harmony of flavors—the succulent chicken is tender and juicy, subtly seasoned to let its natural flavor shine. The rice tastes to rich, thanks to the aromatic chicken fat.", "The chicken is velvety smooth to the touch, with a delicate, almost buttery texture. The rice grains are fluffy yet firm, offering a satisfying bite."],
        "recommend": "I find this dish very comforting. It’s simple, sweet, soy, and cheap- what else can you ask for?  However as simple as it seems, I do think that dish is not as easy as it seems to pull off.  What makes this dish THE DISH is the chicken.  You have to achieve this perfect amount of juiciness and flavor or else it’ll just taste like an overboiled chicken tinola that could not be the best thing to pair to your rice. As complex (and simple?) as I made it sound, if this dish is something you want to recreate yourself, you can check <a href=\"https://youtu.be/NPQb7Ab7COY?si=9cT_W-xERrH0T6i-\" class=\"underline hover:text-blue-700 italic font-bold\" target=\"_blank\">this tutorial</a> by Marrion’s Kitchen (which I’ve personally tried as well). I can guarantee that you don’t have to leave home for the perfect Hainanese Chicken; Sometimes you can just make it at home."
    },
    {
        "id": 5,
        "name": "Laksa",
        "author": "Aliexandra Po",
        "image": "resources/singapore/laksa.png",
        "description": "If you're on the hunt for affordable and authentic Singaporean food, aside from Tiong Bahru Centre, one more name always comes up- 328 Katong Laksa. Known as a must-visit for locals and tourists alike, this iconic eatery serves up one of Singapore’s most beloved dishes—laksa. The aroma of rich coconut broth, fragrant spices, and fresh seafood hits you as soon as you step inside, it’s clear that this spot is a true gem for anyone craving a taste of Singapore. During my visit, I tried their signature Laksa. What sets this dish apart is the perfectly balanced medley of flavors and textures. The creamy coconut broth was rich and spicy, infused with prawn and seafood flavors with thick, slippery rice noodles absorbing the broth, creating the perfect Singaporean Laksa. The dish was topped with fresh prawns and a hard-boiled egg for extra protein. The combination of creamy, spicy, and umami-packed ingredients made every bite unforgettable—proof of Singapore’s culinary brilliance.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["A gorgeous bowl of golden-orange coconut broth with thick rice noodles, and plump prawns. The glossy surface hints at the richness within, and the flavors that’ll hit you when you least expect it.", "By just the smell you can already tell how well-made the dish is, the coconut-y milk smell, aromatic spices, and the briny scent of fresh seafood is what makes laksa a local favorite.", "Rich, creamy broth coats every bite with a perfect balance of spice and sweetness. The prawns are tender and sweet, while the noodles soak up the essence of the broth.", "Smooth and slippery rice noodles glide effortlessly with each spoonful. The broth is velvety on the tongue, while the prawns allow a firm yet tender bite."],
        "recommend": "My family is the biggest fan of Laksa.  I, my dad, and my sister would always go to Bugis, a local Singaporean restaurant in Banawe for a bowl of laksa whenever we would crave for it (which is a lot of times). I find it’s savory broth and interesting fusion of flavors very satisfying and filling. I can say for sure that Laksa is my favorite Singaporean dish and if you’re just like me and you wish to make this from scratch, you can check out <a href=\"https://youtu.be/ssOi5GudOX0?si=2Lgx2LWRgHcMUbqB\" class=\"underline hover:text-blue-700 italic font-bold\" target=\"_blank\">this video</a> by Marrion’s Kitchen, and watch as she breaks down her laksa recipe."
    },
    {
        "id": 6,
        "name": "Stir Fry Char Siew Noodles",
        "author": "Aliexandra Po",
        "image": "resources/singapore/sfcsnoodles.png",
        "description": "If you're craving authentic Singaporean food, there's no need to book a flight—you can enjoy the experience right here at home. One of the most authentic Singaporean restaurants I’ve tried actually has a franchise here: Hawker Chan Philippines. Known for earning a Michelin star in Singapore, Hawker Chan brings its signature dishes to our local dining scene, offering the same flavorful experience closer to home. During my visit, I tried their Stir-Fry Char Siew Noodles. What sets this dish apart is the perfectly balanced combination of smoky, sweet, and savory flavors. The springy egg noodles were expertly stir-fried, soaking up the rich sauce that coated every strand. The char siew (barbecued pork) was tender and caramelized, with just the right amount of char for a smoky depth. Crispy vegetables added a delightful crunch, making each bite both satisfying and unforgettable, indeed a taste of Singapore right here at home.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["A vibrant plate of glistening golden-brown noodles coated in a rich sauce, topped with slices of perfectly caramelized char siew.", "A smoky aroma of charred pork, savory soy sauce, and the distinct scent of wok-fried noodles fills the air.", "A delightful medley of flavors—the savory umami sauce clings to every noodle, balanced by the sweet and smoky char siew. The crispy vegetables provide a fresh counterpoint, while the charred edges of the pork add depth.", "Springy, slightly chewy noodles provide satisfying bites. The juicy char siew melts in your mouth, while the crispy vegetables bring a refreshing crunch."],
        "recommend": "I find this dish the most nakakabusog, and easily the crowd favorite.  Everyone I’ve brought to Hawker Chan has told me that this was their favorite dish and have always expressed how much they enjoyed it.  My theory for this is- that it’s because this dish tastes like Pancit Canton - Yakisoba (bold take, I know) which makes it very familiar and comforting to us Filipinos.  If this impressed my friends, I bet you can impress your family with this too. <a href=\"https://youtu.be/2DoVMLTh4Tw?si=Du1ofHm32DWIkJa8\" class=\"underline hover:text-blue-700 italic font-bold\" target=\"_blank\">Here’s</a> a really easy-to-follow tutorial by Marrion’s Kitchen, one of my favorite foodie YouTubers, which should help you put together the heartwarming Stir Fry Char Siew Noodles for your family."
    },
    {
        "id": 7,
        "name": "Pork and Shrimp Goi Cuon",
        "author": "Audrey Datario",
        "image": "resources/vietnam/pnsGuoiCuon.png",
        "description": "Pork and Shrimp Gỏi Cuốn, also known as Vietnamese fresh spring rolls, are a staple appetizer in Vietnamese cuisine. These light and healthy rolls are made with translucent rice paper wrappers, encasing a combination of fresh vegetables, vermicelli noodles, shrimp, and slices of pork. They are typically served with a rich and creamy peanut butter dipping sauce, adding a layer of nuttiness to the fresh ingredients.",
        "ingredients": ["Rice paper Wrappers (Bánh Tráng)", "Shrimp", "Pork Belly or Pork Shoulder", "Vermicelli Noodles (Bún)", "Cucumber", "Carrot", "Lettuce", "Thai Basil", "Mint", "Cilantro", "Peanut Butter", "Hoisin Sauce", "Soy Sauce", "Rice Vinegar or Lime Juice", "Garlic", "Warm Water", "Crushed Peanuts (for garnish)"],
        "preparation": "What makes this dish unique is its use of fresh, uncooked ingredients wrapped in delicate rice paper. Unlike fried spring rolls, Guo Cuon is served fresh, highlighting the natural flavors and textures of each component. The inclusion of fragrant herbs like Thai basil, cilantro, and mint sets it apart, adding layers of freshness, peppery notes, and a hint of coolness to each bite. The peanut butter sauce adds a distinctive depth of flavor, with its combination of peanut butter, hoisin sauce, garlic, and lime juice, creating a perfect balance of nuttiness, sweetness, and tang.",
        "sensory": ["The moment the server dropped the plate in front of me, I was instantly drawn to the vibrant ensemble of colors. The use of the delicate and slightly sheer rice paper allowed the vibrant colors of greens, white, orange, and pink to peek through.", "The freshness of the dish was immediately noticeable, though the hints of mint and cilantro were quite faint, due to their minimal use in the dish. However, the rich, nutty aroma of the peanut sauce definitely took center stage, adding warmth and depth to the overall scent. A subtle smokiness from the pork lingered in the background, suggesting it was grilled rather than boiled—a deviation from the traditional method. Overall, the delightful fragrances created an ideal atmosphere for this enjoyable starter dish.", "A gentle rustle accompanied each bite of the Goi Cuon, due to the crisp vegetables wrapped within the lettuce and rice paper. The subtle crunch of the vegetables added a satisfying textural contrast to the soft and delicate rice paper wrap.", "The peanut butter sauce was undeniably the star of the show—rich, nutty, and creamy, it wrapped around every bite like a warm embrace, tying all the ingredients together beautifully. Without it, the Goi Cuon would have felt like just a fresh mix of vegetables, shrimp, and pork. But the moment the sauce hit my palate, it was definitely the most important part of this dish. The smokiness of the grilled pork peeked through right after, adding depth and a slight charred aroma. The crisp and fresh vegetables provided a refreshing contrast, while the vermicelli noodles played a balancing role, acting as a neutral buffer that softened the bold flavors without overpowering them. As for the herbs, they were subtle, but I could distinctly pick up the earthy, citrusy notes of cilantro, which added just a hint of brightness to the overall flavor.", "The rice paper, paired with the lettuce, had a soft yet slightly chewy texture. The pork and shrimp were tender, while the cucumber and carrots provided a satisfying crunch that balanced the other elements. The peanut butter sauce was smooth and creamy, while the vermicelli noodles had a light, delicate, and slightly glassy texture, rounding out the roll."],
        "recommend": "This dish was the perfect appetizer—light yet satisfying, stimulating my appetite without being too filling. It might not appeal to those who aren’t fond of vegetables, but if you’re a salad lover like me, this is definitely worth trying. I highly recommend it to anyone looking for a fresh, well-balanced start to their meal. However, be mindful of potential allergens, as the peanut butter sauce and fresh herbs may not be suitable for everyone."
    },
    {
        "id": 8,
        "name": "Phở Do Bien",
        "author": "Audrey Datario",
        "image": "resources/vietnam/PhoDoBien.png",
        "description": "Phở is undoubtedly the most iconic dish in Vietnamese cuisine, recognized worldwide for its aromatic broth and delicate balance of flavors. Traditionally, it is made with beef or chicken, but Phở Do Biển or Seafood Pho offers a refreshing take by incorporating the bounty of Vietnam’s coastal waters. The origins of Phở itself are debated, but most historians believe it evolved in northern Vietnam in the early 20th century, influenced by both Chinese and French culinary traditions.",
        "ingredients": ["Fish Sauce", "Garlic", "Lime/Lemon", "Bean Sprouts", "Rice Noodles (Bánh Phở)", "Star Anise", "Cinnamon", "Cloves", "Cardamom", "Shrimp", "Crabsticks", "Fish Fillet", "Squid Ball", "Thai Basil", "Cilantro", "Lettuce"],
        "preparation": "What sets Phở Do Biển apart is its lighter, more delicate broth, made by gently simmering shrimp shells, fish bones, and squid to extract their natural sweetness. Unlike beef pho, this variation keeps the flavors fresh and subtle, with star anise, cinnamon, cloves, and cardamom enhancing the broth without overpowering the seafood. The seafood is poached just before serving, ensuring tenderness. A medley of Thai basil, coriander, scallions, and cilantro brings herbal brightness, while lime, chili, and bean sprouts provide the perfect finishing touch.",
        "sensory": ["Compared to the vibrant colors of the Goi Cuon, this Phở appeared more muted, with its pale white fish fillet and squid ball blending into the light broth. However, the dish wasn’t entirely without contrast—the shrimp and crab stick added a subtle pop of color, while the fresh Thai basil, cilantro, lettuce, and scallions provided a burst of green.", "The first thing that hit me was the strong aroma of cilantro, rising from the steaming bowl. Beneath that, the broth carried a deep scent, infused with the notes of star anise and cinnamon, adding a hint of sweetness. The presence of fish sauce gave a rich umami depth, blending seamlessly with the delicate brininess of the seafood. Overall, it was strong but a well-balanced fragrance. It was definitely intimidating for someone who dislikes cilantro.", "At first, the flavor wasn't something I enjoyed—the bold hit of cilantro in the broth was a bit overpowering for my taste. But once I started customizing my bowl, everything changed. I tossed in some bean sprouts, fresh Thai basil, and added a drizzle of sriracha, and suddenly, the flavors became better. The basil added just the right amount of freshness to tone down the cilantro, while the sriracha brought a gentle kick that made the broth feel even more comforting. With each sip, the delicate seafood flavors started to shine through, and by the end, I found myself appreciating this dish.", "The seafood is cooked to tender perfection, offering a slightly chewy yet delicate texture. The bánh phở, or silky rice noodles, provide a satisfying contrast, effortlessly absorbing the rich flavors of the broth with every bite."],
        "recommend": "Like I always say—try everything at least once—and that’s the main reason I’d recommend this dish. While I personally struggled with the strong cilantro presence at first, I thoroughly enjoyed it after customizing it to my taste. That said, if you’re someone who dislikes vegetables or bold herbs, this might not be the dish for you. The flavors are particularly herby, with Thai basil, coriander, and the warm sweetness of star anise making a strong impression in every spoonful. However, if you’re feeling under the weather, this is the perfect bowl. The light, fragrant broth paired with tender seafood and vegetables makes it soothing yet nourishing—exactly what you’d want when you need something warm and healing."
    },
    {
        "id": 9,
        "name": "Chuối Chiên",
        "author": "Audrey Datario",
        "image": "resources/vietnam/ChuoiChien.png",
        "description": "Chuối Chiên, or Vietnamese fried banana fritters, is a beloved street food dessert that perfectly balances crispiness and caramelized sweetness. Unlike the Philippines' Turon, which is wrapped in spring roll pastry, or Indonesia’s Pisang Goreng, which is typically served plain, Chuối Chiên is coated in a light rice flour batter, often infused with coconut milk and sesame seeds for extra crispiness and a hint of nuttiness. The bananas, usually saba bananas or plantains, are deep-fried to golden perfection, creating a crunchy shell that gives way to a soft, naturally sweet interior.",
        "ingredients": ["Saba bananas or plantains", "Rice flour", "All-purpose flour", "Coconut milk", "Water", "Sugar", "Salt", "Sesame Seeds", "Baking Powder", "Cinnamon", "Oil", "Vanilla Ice Cream", "Powdered Sugar", "Crushed Peanuts", "Chocolate Syrup"],
        "preparation": "What makes its preparation unique is the double-frying method, where the bananas are first fried at a lower temperature to cook them through, then fried again at a higher temperature to achieve a light, extra-crispy texture. Pho Hoa’s version was generously dusted with sugar and cinnamon and drizzled with chocolate syrup, adding extra layers of warmth and indulgence to an already rich dessert. What sets Chuối Chiên apart is its contrast of textures and flavors, especially when paired with vanilla ice cream. Whether eaten as a street snack or an after-dinner treat, Chuối Chiên is a comforting and nostalgic dessert that transforms a simple banana into something extraordinary.",
        "sensory": ["Seeing this dish instantly brought a sense of nostalgia to when I used to enjoy my Turon with ice cream and cinnamon. The golden, crispy banana fritters were plated beside a smooth, creamy scoop of vanilla ice cream, creating a contrast in both color and texture. A shiny drizzle of chocolate syrup draped over the fritters, while dusting of powdered sugar and cinnamon added a delicate, speckled finish. The crushed peanuts sprinkled on top also provided an extra layer of visual texture.", "The warm, caramelized banana filled the air with a sweet, buttery aroma, complemented by hints of coconut and vanilla. The cinnamon added a comforting warmth, making the dessert even more inviting.", "A satisfying crunch was audible as I took my first bite. It was very crunchy but not crunchy enough to make a mess.", "It was perfectly sweet— just the right amount to be indulgent without being overwhelming. As someone who has grown less fond of overly sweet treats, this was the perfect balance. It wasn’t as sugary as Turon, yet it still delivered that similar delightful and satisfying taste. The cinnamon added a subtle warmth that enhanced the banana, while the chocolate syrup introduced a slight bitterness. Paired with the creamy vanilla ice cream, each bite became the perfect spoonful of dessert—crispy, warm, cold, and rich all at once. The actual batter or wrapping of the fritter tasted like coconut and milk, it was also different from the normal lumpia wrapper used in Turon which is normally thicker.", "The crispy outer layer of the banana fritter cracked gently with each bite, revealing a soft, melt-in-your-mouth center. Aside from that, each spoonful became more enjoyable because of how the smooth velvety ice cream melted next to the banana fritter."],
        "recommend": "This dish almost felt like home—but not quite. Out of the three dishes I tried, this was the most familiar, and I imagine it would be the easiest for most people to enjoy. Unlike the previous dishes, which were rich in spices and herbs, this one relied on simple yet well-balanced flavors to create a perfectly indulgent dessert. I wholeheartedly recommend it to anyone—this time, without any preference-based reservations. It wasn’t overly sweet, but just enough to satisfy a dessert craving, making it a delightful ending to the meal."
    },
    {
        "id": 10,
        "name": "Som Tam",
        "author": "Sofia Co",
        "image": "resources/thailand/somtam.png",
        "description": "While originating from Laos, Som Tam, also known as Green Papaya Salad has made its way into being a staple in Thai cuisine. As opposed to the tangy and spicy dish of Laos, the Thai version puts emphasis on the freshness brought upon by the ingredients, and is often on the sweeter side. The ingredients used to make Som Tam include green papaya, beans, dried shrimp, Thai chilies, sugar, lime juice, tamarind paste, fish sauce, and roasted peanuts. The salad involves little to no cooking and is easy to prepare, perfect for a starter dish.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["The plate is filled with earthy colors of greens and red.", "The smell of the lime juice and fish sauce almost overpowers the rest of the ingredients.", "With every bite comes a crunch coming from the green papaya and roasted peanuts.", "Despite the mix of fish sauce and lime juice, the overall taste is rather light, sweet and refreshing, with just the right amount of spice.", "The papaya remains firm and crunchy despite sitting in a pool of sauce, most likely attributed to the way it is prepared beforehand."],
        "recommend": "This dish is something I would recommend for everyone to try. Personally, I am not fond of salads, and I avoid eating papaya yet after having a taste of this dish, I looked forward to ordering it for my future meals."
    },
    {
        "id": 11,
        "name": "Kaeng Khiao Wan",
        "author": "Sofia Co",
        "image": "resources/thailand/kkwan.png",
        "description": "Kaeng Khiao Wan is considered to be one of the spiciest curries originating from Thailand. While its name translates to sweet-green curry, it does not pertain to the taste of the dish but rather its color. The star of the curry is the paste, which is made from Thai green chili, a milder green pepper, Thai basil, makrut lime zest, galangal, lemongrass, cilantro roots and shrimp paste. Other items needed for the dish include coconut milk, makrut lime leaves, Thai eggplant, and the protein of choice. The ingredients for the paste are crushed using a mortar and pestle before being cooked with the coconut milk, along with the rest of the ingredients.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["It has a distinct light green color unlike other curries I’ve tried which tend to lean towards a more red/yellow color.", "The aroma of the spices used for the paste is somewhat masked by the creaminess of the coconut milk.", "Although appearing to be creamy, the spice soon envelops the insides of the mouth within the first bite. Despite the heat, the flavors make it hard to resist adding more sauce to my rice.", "The popping of bubbles from the boiling sauce can be heard as the dish is served but soon settles down as it cools up.", "Every bite made my mouth feel like it was perpetually on fire, the heat coming from the freshly cooked meal making it worse."],
        "recommend": "Despite it being too spicy for my own tolerance, I found myself taking another bite until I was already full. I would definitely recommend this dish although if you have a low spice tolerance like me, the spice level can be adjusted."
    },
    {
        "id": 12,
        "name": "Khao Niao Mamuang",
        "author": "Sofia Co",
        "image": "resources/thailand/knmamuang.png",
        "description": "The Khao Niao Mamuang is a widely popular Asian dessert which originates from Thailand. Despite its simplicity, this tropical dessert is a perfect mix of sweet and savory. Khao Niao Mamuang can be made with ripe mangoes, glutinous rice, coconut milk, salt, and sugar. To make the dish, the rice simply needs to be cooked in the coconut milk, while the mango is just sliced. Before being served, the rice is usually topped with sesame seeds or crispy mung beans. It is also sometimes served with a thickened coconut sauce on the side.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["The dish looks very simple yet still attracts the eye from the yellow of the ripe mango.", "The fragrance of the ripe mango is sweet and slightly tangy, while the rice has a mild, sweet aroma.", "The sweet taste of the rice and coconut sauce is balanced out by the tropical profile of the mango, giving a nice mix of sweet and sour. Additionally the taste of roasted sesame also lingers for a while after taking a bite.", "For each bite you take, you can hear the stickiness of the rice as a spoonful is pulled away from the clump on the plate.", "Both the rice and mango are soft to the point where your teeth basically sink into each bite. This is contrasted by the topping of either sesame seed or crispy mung bean, which gives off a small crunch."],
        "recommend": "This is a dish I would definitely recommend. Being able to eat something which reminds me of home is a great addition to any trip. To me, it is a great dessert suitable to wrap up any meal."
    },
    {
        "id": 13,
        "name": "Roti Canai",
        "author": "Antonio Mendoza",
        "image": "resources/malaysia/roticanai.png",
        "description": "The Roti Canai is commonly eaten as breakfast in Malaysia and has a crispy, flaky texture and buttery flavor. It is also known as the \"bread\" of Malaysia but is usually referred to as a layered flatbread. The ingredients of Roti Canai are simple enough, such as salt, egg, all-purpose flour, whole milk, water, and ghee (butter). For the preparation of this cuisine, it is simple enough that you can also make it at home. The unique way of cooking this cuisine is to cook it on a griddle thinly to make it flaky and crispy. It is usually accompanied by a side of curry sauce or condensed milk for dipping, adding a sweet and savory flavor to the Roti.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["A piece of bread which is similar to pita bread except that it is thinner and some layers are folded.", "The Roti itself doesn't smell anything, but you can smell the aromatic smell of the curry dip and the sweetness of the condensed milk.", "You can hear the crunch of the flatbread whenever you tear some of its parts.", "The roti itself tasted buttery and plain, like bread, but the curry dipping sauce elevated its taste by making it savory and rich. If you are more inclined to have a sweeter flavor experience, dip it in the condensed milk.", "It is flaky and crispy in texture since they cooked it thinly and waited for it to have golden spots. It is also a bit oily since they used butter to cook the roti."],
        "recommend": "I recommend this dish since it is the dish I most enjoyed, and I like the texture of the Roti in my mouth. I will also give you options for what taste you want, like plain, savory, or sweet, which makes it a good experience for me as someone who gets bored with a redundant flavor."
    },
    {
        "id": 14,
        "name": "Nasi Goreng Pattaya",
        "author": "Antonio Mendoza",
        "image": "resources/malaysia/nasigoreng.png",
        "description": "Nasi Goreng is a type of Fried rice dish wrapped in a thin layer of an egg omelette. We can say that it is an Omurice version (Japanese fried rice) of Malaysia. It is widely known as an Indonesian-style fried rice but originated in Malaysia. The ingredients used for this dish are rice, meat(beef or chicken), vegetables, tomato ketchup, shrimp, eggs, tomato, and vegetable oils. Salt, fish sauce, and white pepper are primarily used for this cuisine. It is unique from other fried rice dishes because it uses fish sauce to flavor it. Nasi Goreng Pattaya is also wrapped in an egg omelette, which makes it different from other fried rice cuisines.",
        "ingredients": [""],
        "preparation": "",
        "sensory": ["It looks like rich and flavorful fried rice covered with a thin layer of an egg omelet drizzled with tomato sauce.", "I can smell the large amount of pepper used in the dish and the tomato sauce used to make it smell sweeter.", "Although the smell of pepper is strong, it is actually not strong when you taste it since you can also taste the tomato sauce and other vegetables used, which balances the dish.", "The texture is similar to the typical fried rice we cook here in our country but is much more moist than ours."],
        "recommend": "For me, I can somewhat recommend this dish since it is unique in a way that an omelet covers it, but if you're looking for a distinctive taste, I think I would not recommend it since it is similar to our take on fried rice, but theirs is slightly sweeter."
    }
  ]
  